# Operations

In [2]:
import numpy as np
import pandas as pd

df = pd.DataFrame(
    {
        'col1': [1, 2, 3, 4],
        'col2': [444, 555, 666, 444],
        'col3': ['abc', 'def', 'ghi', 'xyz']
    }
)

df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## Info on unique values

In [4]:
# returns the set of unique values
df['col2'].unique()

array([444, 555, 666])

In [5]:
# number of unique values
df['col2'].nunique()

3

In [7]:
# number of occurences of each unique values
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

## Selecting Data

In [9]:
print(df.head())
df[(df['col1'] > 2) & (df['col2'] == 444)]

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

   col1  col2 col3
3     4   444  xyz

## Applying Functions

In [11]:
def times2(x):
    return x * 2

df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [13]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [16]:
df['col1'].sum()

10

In [17]:
# 永久删除一列
del df['col1']

In [18]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [20]:
# 获取columns 和 indexes

df.columns

Index(['col2', 'col3'], dtype='object')

In [22]:
df.index

RangeIndex(start=0, stop=4, step=1)

** Sorting and ordering a DataFrame **

In [24]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [25]:
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

** Check for null values **

In [26]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [27]:
# Drop rows with null values

df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Fill in null values with something else **

In [29]:
df = pd.DataFrame(
    {
        'col1': [1, 2, 3, np.nan],
        'col2': [np.nan, 555, 666, 444],
        'col3': ['abc', 'def', 'ghi', 'xyz']
    }
)

df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [31]:
df.fillna('FILL')

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  444.0  xyz

In [32]:
data = {
    'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
    'B': ['one', 'one', 'two', 'two', 'one', 'one'],
    'C': ['x', 'y', 'x', 'y', 'x', 'y'],
    'D': [1, 3, 2, 5, 4, 1]
}

df = pd.DataFrame(data)

In [34]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [35]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [38]:
df.pivot_table(values='D', index='A', columns=['C'])

C      x    y
A
bar  4.0  3.0
foo  1.5  3.0

# Great Job!